In [66]:
import numpy as np
import pandas as pd

# Basic Aggregations

In [171]:
data = {'Product': ['A', 'B', 'C', 'A', 'B', 'C', 'A', 'B', 'C'], 
'Region': ['North', 'South', 'East', 'West', 'North', 'South', 'East', 'West', 'North'], 
'Units_Sold': [10, 15, 20, 5, 10, 15, 10, 5, 15], 
'Price': [100, 200, 150, 100, 200, 150, 100, 200, 150]}

In [172]:
df_sales = pd.DataFrame(data)

In [173]:
df_sales

  Product Region  Units_Sold  Price
0       A  North          10    100
1       B  South          15    200
2       C   East          20    150
3       A   West           5    100
4       B  North          10    200
5       C  South          15    150
6       A   East          10    100
7       B   West           5    200
8       C  North          15    150

In [174]:
df_sales["Revenue"] = df_sales["Units_Sold"] * df_sales["Price"]

In [175]:
print(df_sales)

  Product Region  Units_Sold  Price  Revenue
0       A  North          10    100     1000
1       B  South          15    200     3000
2       C   East          20    150     3000
3       A   West           5    100      500
4       B  North          10    200     2000
5       C  South          15    150     2250
6       A   East          10    100     1000
7       B   West           5    200     1000
8       C  North          15    150     2250

In [176]:
list = ["Units_Sold", "Revenue"]

In [177]:
df_sales['Sum'] = df_sales[list].sum(axis=1)
print(df_sales)

  Product Region  Units_Sold  Price  Revenue   Sum
0       A  North          10    100     1000  1010
1       B  South          15    200     3000  3015
2       C   East          20    150     3000  3020
3       A   West           5    100      500   505
4       B  North          10    200     2000  2010
5       C  South          15    150     2250  2265
6       A   East          10    100     1000  1010
7       B   West           5    200     1000  1005
8       C  North          15    150     2250  2265

In [178]:
df_sales['Avg'] = df_sales[list].mean(axis=1)
print(df_sales)

  Product Region  Units_Sold  Price  Revenue   Sum     Avg
0       A  North          10    100     1000  1010   505.0
1       B  South          15    200     3000  3015  1507.5
2       C   East          20    150     3000  3020  1510.0
3       A   West           5    100      500   505   252.5
4       B  North          10    200     2000  2010  1005.0
5       C  South          15    150     2250  2265  1132.5
6       A   East          10    100     1000  1010   505.0
7       B   West           5    200     1000  1005   502.5
8       C  North          15    150     2250  2265  1132.5

# Grouping Data

In [179]:
df_sales.groupby("Product")[["Units_Sold","Revenue"]].sum()

         Units_Sold  Revenue
Product
A                25     2500
B                30     6000
C                50     7500

In [180]:
df_sales.groupby("Region")[["Units_Sold", "Revenue"]].mean()

        Units_Sold  Revenue
Region
East     15.000000   2000.0
North    11.666667   1750.0
South    15.000000   2625.0
West      5.000000    750.0

In [181]:
df_sales.groupby(["Product","Region"])[["Units_Sold", "Revenue"]].sum()

                Units_Sold  Revenue
Product Region
A       East            10     1000
        North           10     1000
        West             5      500
B       North           10     2000
        South           15     3000
        West             5     1000
C       East            20     3000
        North           15     2250
        South           15     2250

# Sorting and Ranking Data

In [182]:
df_sales.sort_values(["Units_Sold"])

  Product Region  Units_Sold  Price  Revenue   Sum     Avg
3       A   West           5    100      500   505   252.5
7       B   West           5    200     1000  1005   502.5
4       B  North          10    200     2000  2010  1005.0
0       A  North          10    100     1000  1010   505.0
6       A   East          10    100     1000  1010   505.0
1       B  South          15    200     3000  3015  1507.5
5       C  South          15    150     2250  2265  1132.5
8       C  North          15    150     2250  2265  1132.5
2       C   East          20    150     3000  3020  1510.0

In [183]:
df_sales.sort_values(["Revenue"], ascending=False)

  Product Region  Units_Sold  Price  Revenue   Sum     Avg
1       B  South          15    200     3000  3015  1507.5
2       C   East          20    150     3000  3020  1510.0
8       C  North          15    150     2250  2265  1132.5
5       C  South          15    150     2250  2265  1132.5
4       B  North          10    200     2000  2010  1005.0
0       A  North          10    100     1000  1010   505.0
6       A   East          10    100     1000  1010   505.0
7       B   West           5    200     1000  1005   502.5
3       A   West           5    100      500   505   252.5

In [163]:
df_sales["Revenue_Rank"]=df_sales["Revenue"].rank(ascending=False)

In [164]:
df_sales

  Product Region  Units_Sold  Price  Revenue  Revenue_Rank
0       A  North          10    100     1000           7.0
1       B  South          15    200     3000           1.5
2       C   East          20    150     3000           1.5
3       A   West           5    100      500           9.0
4       B  North          10    200     2000           5.0
5       C  South          15    150     2250           3.5
6       A   East          10    100     1000           7.0
7       B   West           5    200     1000           7.0
8       C  North          15    150     2250           3.5

# Merging DataFrames

In [184]:
product_data = {'Product': ['A', 'B', 'C'], 
'Category': ['Electronics', 'Furniture', 'Appliances']} 
df_products = pd.DataFrame(product_data)

In [185]:
df_products

  Product     Category
0       A  Electronics
1       B    Furniture
2       C   Appliances

In [186]:
df_merged = pd.merge(df_sales, df_products, on=["Product"])

In [187]:
df_merged

  Product Region  Units_Sold  Price  Revenue   Sum     Avg     Category
0       A  North          10    100     1000  1010   505.0  Electronics
1       B  South          15    200     3000  3015  1507.5    Furniture
2       C   East          20    150     3000  3020  1510.0   Appliances
3       A   West           5    100      500   505   252.5  Electronics
4       B  North          10    200     2000  2010  1005.0    Furniture
5       C  South          15    150     2250  2265  1132.5   Appliances
6       A   East          10    100     1000  1010   505.0  Electronics
7       B   West           5    200     1000  1005   502.5    Furniture
8       C  North          15    150     2250  2265  1132.5   Appliances

In [193]:
df_merged.groupby("Category")["Revenue"].sum()
df_merged

  Product Region  Units_Sold  Price  Revenue   Sum     Avg     Category
0       A  North          10    100     1000  1010   505.0  Electronics
1       B  South          15    200     3000  3015  1507.5    Furniture
2       C   East          20    150     3000  3020  1510.0   Appliances
3       A   West           5    100      500   505   252.5  Electronics
4       B  North          10    200     2000  2010  1005.0    Furniture
5       C  South          15    150     2250  2265  1132.5   Appliances
6       A   East          10    100     1000  1010   505.0  Electronics
7       B   West           5    200     1000  1005   502.5    Furniture
8       C  North          15    150     2250  2265  1132.5   Appliances